# ------单分类全物品中物品分类的索引目录------ #
idx_menu_single = {

    1: '石头类', 2: '三废石类', 3: '沙子类', 4: '矿物类', 
    5: '铜矿类', 6: '深板岩类', 7: '珊瑚类', 8: '红石类', 
    9: '工作方块类', 10: '木材类', 11: '阴间建材类', 12: '末地建材类', 
    13: '海晶系列', 14: '植物&农牧类', 15: '炼药材料与怪物掉落', 16: '十六色', 
    17: '其他'
}

# ------多分类全物品中物品分类的索引目录------ #
idx_menu_multi = {

    1:"圆石及其附属", 2:"石头及其附属", 3:"平滑石及其附属", 4:"石砖及其附属",
    5:"安山岩及其附属", 6:"花岗岩及其附属", 7:"闪长岩及其附属", 8:"新三废石",
    9:"沙子及其附属", 10:"红沙及其附属", 11:"砂砾及其附属",
    12:"铁矿及其附属", 13:"金矿及其附属", 14:"青金石及其附属", 15:"钻石及其附属", 16:"绿宝石及其附属",
    17:"煤矿及其附属", 18:"红石矿及其附属", 19:"石英矿及其附属", 20:"远古残骸及其附属", 21:"铜矿及其附属",
    22:"深板岩及其附属", 23:"深板岩砖及其附属", 24:"磨制深板岩及其附属", 25:"深板岩瓦及其附属",
    26:"珊瑚", 27:"珊瑚扇", 28:"珊瑚块",
    29:"压力板", 30:"按钮", 31:"红石中继器", 32:"红石比较器", 33:"活塞", 34:"物品发射元件", 35:"拉杆", 
    36:"侦测器", 37:"音符盒", 38:"红石块", 39:"红石火把", 40:"漏斗", 41:"堆肥桶", 42:"门", 43:"红石粉", 44:"粘性方块",
    45:"TNT", 46:"铁轨", 47:"活板门", 48:"栅栏门", 49:"其他红石元件", 50:"工作方块", 51:"铁砧及其附属",
    52:"箱子及其附属", 53:"木棍", 54:"橡木", 55:"云杉", 56:"白桦", 57:"金合欢", 58:"丛林木", 59:"深色橡木",
    60:"绯红木", 61:"诡异木", 62:"下界砖及其附属", 63:"红色下界砖及其附属", 64:"地狱岩", 65:"玄武岩及其附属",
    66:"石英方块及其附属", 67:"黑石及其附属", 68:"其他阴间建材", 69:"末地建材", 70:"海绵", 71:"海晶建材",
    72:"植物农牧类", 73:"混凝土及其粉末", 74:"染色玻璃", 75:"染色玻璃板", 76:"陶瓦", 77:"带釉陶瓦", 78:"羊毛",
    79:"地毯", 80:"旗帜", 81:"蜡烛", 82:"染料", 83:"潜影壳", 84:"骨头及其附属", 85:"线", 86:"头颅", 87:"炼药材料",
    88:"小黑掉落", 89:"其他怪物掉落", 90:"泥土", 91:"红砖", 92:"蜂蜜", 93:"紫水晶及其附属", 94:"烟花及其附属",
    95:"黑曜石及其附属", 96:"冰雪建材", 97:"其他" 

}

# ------全物品中物品能否烧炼或作为燃料的索引目录------ #
idx_burn = {1:"只能被烧炼", 2:"只能作为燃料", 3:"可以被烧炼或作为燃料"}

# ------全物品中物品获得方式的索引目录------ #
idx_get = {1:"工作台合成", 2:"切石机合成", 3:"工作台或切石机合成"}
